Revit 2027 API
ScheduleField.GetSchedulableField Method
 Gets a SchedulableField object representing this field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SchedulableField GetSchedulableField()
Public Function GetSchedulableField As SchedulableField
public:
SchedulableField^ GetSchedulableField()
member GetSchedulableField : unit -> SchedulableField
Return Value
SchedulableField
 The SchedulableField object.
Exceptions
Exception | Condition
InapplicableDataException |  This ScheduleField is not a schedulable field by type(non-calculated/non-combined-parameter).
Remarks
 A ScheduleableField cannot be obtained for: - Calculated fields - Combined parameters
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace